In [1]:
import sqlite3
import pandas as pd

# Create a database connection
conn = sqlite3.connect(":memory:")  # Creates a temporary in-memory database
cursor = conn.cursor()

# Check if SQLite is working
cursor.execute("SELECT sqlite_version();")
print("SQLite is working! Version:", cursor.fetchone()[0])

SQLite is working! Version: 3.45.3

In [2]:
# Create employees table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary INTEGER,
    department TEXT
);
''')

In [3]:
cursor.executemany('''
INSERT INTO employees (name, salary, department) VALUES (?, ?, ?);
''', [
    ('Alice', 60000, 'HR'),
    ('Bob', 50000, 'IT'),
    ('Charlie', 55000, 'Finance'),
    ('David', 75000, 'IT'),
    ('Eva', 62000, 'HR'),
    ('Frank', 70000, 'Finance'),
    ('Grace', 80000, 'IT')
])
conn.commit()
print("Table created & data inserted successfully!")

Table created & data inserted successfully!

In [4]:
query = '''
SELECT COUNT(*) FROM employees;
'''
df = pd.read_sql(query, conn)
df

   COUNT(*)
0         7

In [5]:
query = '''
SELECT COUNT(name) FROM employees;
'''
df = pd.read_sql(query, conn)
df

   COUNT(name)
0            7

In [6]:
query = '''
SELECT SUM(name) FROM employees;
'''
df = pd.read_sql(query, conn)
df

   SUM(name)
0        0.0

In [7]:
query = '''
SELECT SUM(salary) FROM employees;
'''
df = pd.read_sql(query, conn)
df

   SUM(salary)
0       452000

In [8]:
query = '''
SELECT AVG(salary) FROM employees;
'''
df = pd.read_sql(query, conn)
df

    AVG(salary)
0  64571.428571

In [9]:
query = '''
SELECT MIN(salary),MAX(salary) FROM employees;
'''
df = pd.read_sql(query, conn)
df

   MIN(salary)  MAX(salary)
0        50000        80000

In [10]:
query = '''
SELECT name, MIN(salary),MAX(salary) FROM employees;
'''
df = pd.read_sql(query, conn)
df

    name  MIN(salary)  MAX(salary)
0  Grace        50000        80000

In [11]:
query = '''
SELECT department, AVG(salary) FROM employees;
'''
df = pd.read_sql(query, conn)
df

  department   AVG(salary)
0         HR  64571.428571

In [12]:
query = '''
SELECT department, AVG(salary) FROM employees GROUP BY department;
'''
df = pd.read_sql(query, conn)
df

  department   AVG(salary)
0    Finance  62500.000000
1         HR  61000.000000
2         IT  68333.333333

In [14]:
query = '''
SELECT department, COUNT(*) FROM employees GROUP BY department HAVING COUNT(*) >2;
'''
df = pd.read_sql(query, conn)
df

  department  COUNT(*)
0         IT         3